app/controllers/articles_controller.rb

  def index
    @articles = Article.all.page(params[:page]).per(10)
---
SELECT  `articles`.* FROM `articles` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `articles`

  def create
    @article = Article.new(article_param)
    if @article.save
---
INSERT INTO `articles` (`title`, `content`, `created_at`, `updated_at`) VALUES ('asd', 'asd', '2016-07-25 15:13:14', '2016-07-25 15:13:14')

  def update
    if @article.update(article_param)
---
UPDATE `articles` SET `title` = '标题41111', `updated_at` = '2016-07-25 15:27:45' WHERE `articles`.`id` = 5

  def destroy
    if @article.destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 1

  def find_article
    @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = NULL LIMIT 1